ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ГрадацияЦенПредварительныхСтавок/ЖБИ_ГрадацияЦенПредварительныхСтавок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_ГрадацияЦенПредварительныхСтавок</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасстояниеОт</name>
    <comment>Расстояние от, км</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РасстояниеДо</name>
    <comment>Расстояние до, км</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_ГрадацияЦенПредварительныхСтавок/ManagerModule.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ПолучитьПустуюТаблицуНаборЗаписей() Экспорт
	
	НаборЗаписей 		= РегистрыСведений.ЖБИ_ГрадацияЦенПредварительныхСтавок.СоздатьНаборЗаписей();	
	Табл 				= НаборЗаписей.ВыгрузитьКолонки();
	
	Возврат Табл;
	
КонецФункции

Функция ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров) Экспорт 
	
	ТаблицаНабораЗаписей = ПолучитьПустуюТаблицуНаборЗаписей();
	НоваяСтр = ТаблицаНабораЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтр,СтруктураПараметров);
	
	Возврат ТаблицаНабораЗаписей;
	
КонецФункции

Функция СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,СписокСвойствОбновления,СтруктураПоиска = Неопределено,СообщениеОбОшибке) Экспорт
	
	Для Каждого СтрокаНабораЗаписей Из ТаблицаНабораЗаписей Цикл	
		
		НаборЗаписей = РегистрыСведений.ЖБИ_ГрадацияЦенПредварительныхСтавок.СоздатьНаборЗаписей();
		
		Отбор = НаборЗаписей.Отбор; 
		Отбор.Партнер.Установить(СтрокаНабораЗаписей.Партнер);
		Отбор.РасстояниеОт.Установить(СтрокаНабораЗаписей.РасстояниеОт);
		Отбор.РасстояниеДо.Установить(СтрокаНабораЗаписей.РасстояниеДо);
		Если СтруктураПоиска<>Неопределено Тогда
			Для Каждого Ном Из СтруктураПоиска Цикл 
				Отбор[Ном.Ключ].Установить(Ном.Значение);	
			КонецЦикла;
		КонецЕсли;		
		НаборЗаписей.Прочитать();	
		Если НаборЗаписей.Количество() > 0 Тогда
			Для Каждого Запись Из НаборЗаписей Цикл				
				Если СписокСвойствОбновления = Неопределено Тогда 
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей);
				Иначе
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей, СписокСвойствОбновления);
				КонецЕсли;		
			КонецЦикла;		
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;;
		Иначе 
			МенеджерЗаписи = РегистрыСведений.ЖБИ_ГрадацияЦенПредварительныхСтавок.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрокаНабораЗаписей);			
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
								
	Возврат ?(ПустаяСтрока(СообщениеОбОшибке),Истина,Ложь);
	
КонецФункции

#КонецОбласти
